{"meta":{"title":"WU WEN XI DONG","subtitle":null,"description":"爱学习的大猴子","author":"Mineduan","url":"https://mineduan.github.io/wuwenxidong"},"pages":[{"title":"categories","date":"2018-01-18T11:45:50.000Z","updated":"2018-01-18T12:15:44.180Z","comments":true,"path":"categories/index.html","permalink":"https://mineduan.github.io/wuwenxidong/categories/index.html","excerpt":"","text":""},{"title":"about","date":"2018-01-22T13:35:27.000Z","updated":"2018-01-22T13:36:34.611Z","comments":true,"path":"about/index.html","permalink":"https://mineduan.github.io/wuwenxidong/about/index.html","excerpt":"","text":"关于我从事 WEB 开发，主要开发语言 PHP，熟悉使用 Laravel、ThinkPHP 等主流框架；对 Modern PHP 情有独钟；有一定的代码洁癖。 对服务端、前端、数据分析等技能有所了解。 热爱开源项目、热爱新技术、热爱新事物。 关于工作城市：深圳 关于学习正在往终身学习者前进… 近期学习方向：Python (人工智能) 关于座右铭The Harder You Work, The Luckier You Will Be. (越努力，越幸运) 关于爱好热爱运动，尤其喜爱羽毛球、阅读、电影（Top250）、旅行。 联系我Home: minhow.comBlog: blog.minhow.comEmail: huangminhow@gmail.comGitHub: MinHowWeiBo: MinHowTwitter: MinHow"},{"title":"tags","date":"2018-01-18T11:44:37.000Z","updated":"2018-01-18T11:45:37.067Z","comments":true,"path":"tags/index.html","permalink":"https://mineduan.github.io/wuwenxidong/tags/index.html","excerpt":"","text":"layout: tagscomments: false"}],"posts":[{"title":"少数民族去哪了（二）：五胡乱华","slug":"少数民族去哪了（二）：五胡乱华","date":"2018-01-21T16:00:00.000Z","updated":"2018-01-22T14:28:52.711Z","comments":true,"path":"2018/01/22/少数民族去哪了（二）：五胡乱华/","link":"","permalink":"https://mineduan.github.io/wuwenxidong/2018/01/22/少数民族去哪了（二）：五胡乱华/","excerpt":"","text":"在西方日耳曼入侵（公元4世纪左右）发生的同时，东方也发生了一起北方蛮族入侵事件，那就是五胡乱中华。 话说东汉末年分三国，战火连绵不休，好不容易三分归晋，又来个八王之乱。打仗是会死很多人的。以长安为例，王莽之乱之后，长安破败，汉光武帝刘秀定都洛阳，史称东汉。经过东汉的修养，长安又重归繁荣，于是董卓一把火烧了洛阳，又迁都长安。吕布杀董卓，死了很多人；李傕逐吕布，又死了很多人。 这里介绍一个三国时期的牛人——贾诩。一说三国的聪明人，大家都知道卧龙凤雏，或者曹操司马懿，或者赤壁周郎周公瑾。而这个贾诩，说实话一点都不比他们差。他最大的成就，就是一语亡国。一句话，毁了汉朝三百年国祚。话说吕布武力虽强，但在董卓的部队里面地位其实不是很高，相当于总司令的警卫团团长而已，而董卓部下的王牌军，都是在李傕郭汜掌握下。当吕布作乱杀了董卓后，李傕郭汜等人都畏罪潜逃，准备跑回西凉老家。路上就碰到贾诩了。贾诩问：“将军这是去哪里啊？”李傕回答：“董司令已经被司徒王允和吕布杀了，下一个估计就要来杀我们了，所以赶紧逃吧！”贾诩说：“将军一个人跑回老家，路上随便一个乡长就能把你抓了，押送回来杀头，哪里回得了老家？但是将军手下几个军的兵力，整顿一下杀回长安，吕布一个警卫团哪里抵挡得住？天子长安不是尽在掌握之中。”就这一句话，汉朝彻底亡了。 李傕觉得有道理，带兵杀了，驱逐吕布，斩杀王允，长安又死了很多人。之后李傕郭汜又反目，又杀了很多人，逼得汉献帝出逃，被曹操接走。曹操收回长安后，又与西北马家军起冲突，于是马超带兵一路杀到长安，杀得曹操割须弃袍，又死了很多人。随后曹操杀了回来击败马超，又收回长安，又死了很多人。虽然之后的三国长安不再有战火，但是魏蜀之间的战争，都在长安附近。先是曹操平张鲁在汉中，随后黄忠斩夏侯渊于定军山，诸葛亮六出祁山，姜维九伐中原，都是在长安附近打的战，长安都要出士兵出脚夫保障后勤供应，同样会造成人口的减少。人口减少，自然会有新的人口迁移进来，汉人少了，就只能迁胡人进来。晋惠帝元康九年（公元299年），太子洗马陈留江统作《徙戎论》提醒朝廷说，关中人口百万，胡人占了一半（《资治通鉴》第八十三卷）。 整个中国北方也处处可见胡人。按当时的观念，若论亲疏，当然汉人才是自己人。而打仗是要死人的，让自己人去死，当然不如让外人去死。因此对于统治阶级而言，让汉人去打仗，就不如用胡人去打仗。当年汉元帝把南匈奴安置在河套地区，就是用来抵挡北匈奴的，以夷制夷嘛。本来一开始还是让汉人去当统帅，后来发现还是直接让胡人当统帅效果更好，于是很多胡人都受到重用。例如并州（现山西省）的匈奴刘渊（这时候很多胡人也在汉化，其父刘豹已经起汉名了。由于冒顿单于娶了刘邦的宗室之女，所以他们自认为汉室刘家的外孙，也取汉姓刘。），后来当到了宁朔将军，监五部军事。朔，本来指的是北方，后来主要指河套地区，汉武帝赶走匈奴后在这里设了朔方郡。宁朔将军，就是朔这个地方的安宁就你负责了。五部，就是当年曹操将南匈奴分化管理，分为左右南北中五部，每部都设置有统帅，并以汉人监管。现在都让刘渊一个人一起监了。你们胡人负责打仗，我们汉人负责享福，估计这是当时很多汉人统治者的想法。虽然对外战争重用胡人效果很好，但是渐渐的，胡人也掌握了军权，内附的胡人也渐渐变成了一种内患。不过只要汉人团结，还是可以控制住胡人的，但是如果不团结，例如西晋的八王之乱，那就hold不住胡人了。 八王之乱，就是司马家八个王通过武力轮流掌权，自相残杀得是不亦乐乎，将中国北方毁得不堪入目。你汉人不团结，就别怪我胡人追求独立自主了。于是公元304年，刘渊揭竿而起。他不是认为自己是汉室刘家的外孙吗？好吧，那建立的国家就叫“汉”好了，史称匈奴汉国。当时距离东汉禅魏（公元220年）才80多年，期间还有个举着“汉”旗的蜀汉政权，因此匈奴人刘渊托“汉”之名很有利于团结胡汉双方的人才，获得胡汉双方百姓的支持。于是匈奴汉国发展很快，最终成功把西晋打趴下，成为北方一霸。 后来匈奴汉国内乱，刘渊养子刘曜平乱后登基。可能觉得没必要再给汉人装孙子了吧，于是在公元318年更改国号。由于匈奴刘家起家于平阳，位于今天的山西南部地区（临汾附近），战国时期属于赵国，因此改国号为“赵”。毕竟都是匈奴刘家建的国，于是统称为“汉赵”，又区别于石勒的赵国，于是也叫“前赵”。 图7 汉赵疆域图（公元317年） 这就是五胡乱华的第一胡——匈奴。（其他匈奴）顺便说一下。晋朝是一个统一的王朝，八王之乱主要发生在北方，后来晋愍帝司马邺降汉之后，南方的汉人贵族不同意投降，于是拥立琅琊王司马睿为皇帝，定都建康（现南京），继承大统，史称东晋。曾经有部根据小说改编的电视剧《琅琊榜》，就跟这个背景有关系。 而五胡中的第二胡，就是羯。话说羯族，有明显的白种人特征，深目高鼻多须，他们其实也是匈奴的奴，不知道匈奴在打中亚哪里的时候抓到的俘虏，带着自己的特色一直跟着匈奴混，也被称为“匈奴别部”，随着匈奴一起迁入中原。 羯族的代表就是石勒。要说当过皇帝的人的起点，朱元璋就够低的了，朱元璋是当过和尚当过乞丐，而这石勒这是中国史上唯一一个从奴隶起家的皇帝，可见他奋斗的艰辛。他一开始自己混，混得有点资本了就入股刘渊的匈奴汉国，而当刘渊养子刘曜平乱后自立为王时，跟石勒没处好，于是石勒就自立门户。由于他实际占据了古代赵国的统治地区，于是在公元319年自称大将军、大单于、领冀州牧、赵王，于襄国即赵王位。由于立得比刘曜的“赵”晚，又持续得长，于是史称“后赵”。石勒在几乎占领整个中国北方后，于公元330年正式称帝。石勒的后赵势力已经南侵到江夏合肥，围困过湖北襄阳，盘算着江陵武汉，这里已经算中国的南方了。 图 8 后赵疆域图 石勒死后，他侄子石虎独揽朝政，第二年就篡了石勒儿子的皇位。这石虎的残暴是史上留名的。石虎的太子石邃一直跟着他爸征战四方，灭前赵就有他的功劳，石虎很喜欢他。石虎还经常跟大臣们说：“司马氏父子兄弟自相残杀，所以朕得以有今天。而朕岂有杀石邃的道理呢！”后来，父子有隙，于是石虎把石邃杀了，“及其妃张氏，并男女二十六人同埋于一棺”（《资治通鉴》第九十五卷）。 这段时间，历史称为东晋十六国，或者五胡十六国。故事并不是单一的一个西晋，崛起个汉赵顶替西晋，再崛起个后赵顶替汉赵。在这条故事线发生的同时，好多个其他胡也在崛起，如五胡中的第三胡——氐。 氐族分布在今甘肃、陕西、四川等省的交界处，大部分集中于陇南地区，早在西周时期属于西戎的一部，到了春秋战国时期开始以氐作为族称。虽然氐族也在崛起，但是当不了老大。西晋末年，略阳（属陕西省汉中市）氐族推出贵族苻洪为小头头。一开始跟着刘家混，前赵刘曜在长安称帝时，封苻洪为氐王。后来石勒把前赵灭了，苻洪又跟着石家混。公元333年，石虎让苻洪当流民都督，带领关中豪杰与各种胡人搬家到关东的枋头（今河南省鹤壁市浚县）。强制搬迁，大家心里肯定不乐意。于是石虎一死（公元349年），苻洪就投降了东晋，第二年350年，苻洪在枋头就自称大都督、大将军、大单于、三秦王。不久苻洪被石虎旧将麻秋毒死，其子苻健继位。苻健大喊：“我要带你们回家！”，于是自枋头而西，直入长安，据有关陇。351年，苻健自称大秦天王、大单于。352年，改称皇帝，国号秦，史称前秦。苻健死后，其子苻生继位，这又是一个出了名的残暴之主。有一次找人过来问，“我这皇帝当得怎么样啊？你在外面听说些什么啊？”多好的拍马屁的机会啊，于是有人赶紧回答：“圣明宰世，赏罚明当，天下唯歌太平。”苻生说：“你谄媚我！”于是拉出去斩了。过了几天又找人问，“我这皇帝当得怎么样啊？”前两天才发生的事情，你还来！于是大家不敢拍马屁了，有人就回答：“陛下判刑处罚还是有一点点过了的。”苻生说：“你诽谤我！” 于是拉出去斩了。这是没事找事鸡蛋里挑刺，想着借口杀人。于是“勋旧亲戚，诛之殆尽。”（《资治通鉴》第一百卷） 这种事情发生多了，难免大家会想：“照这么杀下去，早晚轮到我。”这样想的人多了，难免会有一伙人想：“等你杀我，不如我杀你，先下手为强。”这样想的人多了，难免有人就真动手了。于是，苻家最闪亮的男神登场了，时任龙骧将军的东海王苻坚带人杀入宫中干掉了苻生。苻坚和苻生是同一个爷爷，就是三秦王苻洪，他也是有资格继承皇位的。苻坚继位后，重用宰相王猛，励精图治，终于在公元376年再次统一了中国北方，距离开始分裂的八王之乱（291年）已经过去85年。于是又过了6年，公元382年十月，苻坚召集群臣，提出亲率百万大军一举灭晋，实现中国统一。于是发生接下来的淝水之战。 图9 前秦疆域图 一方面，东晋，多年来一直没怎么雄起，偏安东南，说自己是正统都有点不好意思了。总指挥谢安清点了一下兵力，就八万人马，还不够前秦的十分之一。那硬着头皮也得上啊，毕竟人家打到家门口了。于是前线指挥谢玄带着人马来到淝水东岸与苻坚对峙。 另一方面，前秦，虽号称百万大军，但却不是铁板一块。苻坚倒是希望有清一色的百万氐人军队，但氐人哪有那个人口基数。所以构成这百万大军的，是各色人种都有。汉人匈奴羯人，应有尽有。北方统一才6年，可分裂了近百年，还加入了很多外来民族，民族融合完全处于一种马赛克的状态，完全没法融合。你能指望这一百万人同心协力？肯定是各怀鬼胎，伺机而动。所以当苻坚提出要南征的时候，阳平公苻融就说：“东晋虽然没雄起，但是也好好的，没啥内患。人家上下一心，也不好打。反倒是我们统一北方时被我们灭掉的各个胡人政权，政权是没了，但是人还在，心还不死，而且布满京师，那才是我们的心腹大患。把他们消化掉才是最重要的。当年丞相王猛临死前也是这么说的啊！”苻坚不听，一定要带着这百衲衣般的百万大军，南下东晋，来到淝水西岸。 这两边都压在河边，都想等对方半渡而击，都不动。于是谢玄派人跟苻坚说：“你来都来了，咱就扯开膀子干一战吧。你压在河边我过不去，你往后退退，我过来跟你一决雌雄。”苻坚说：“好！看你过来我怎么干你。传令下去，往后退退。” 一百万，那是多大一个数字！排成方阵，前面死光了后面都看不见什么情况。 苻坚说往后退退，A听了对后面B说：往后退退，让那边晋军过来。 B对后面C说：往后退退，那边晋军要过来。 C对后面D说：往后退退，那边晋军要过来了。 D对后面E说：快往后退退，那边晋军过来了。 E对后面F说：赶紧往后退，晋军过来了。 F对后面G说：赶紧往后撤，晋军杀过来了！ 再往后传，就更离谱了。反正，完全失控了。到了最后成了：赶紧逃命吧，晋军杀过来啦！我们败啦！ 就这样，百万大军做雪崩状，兵败如山倒，任你苻坚再英明神武也阻止不了。苻坚逃回洛阳时，就只剩十余万惊弓之鸟了。苻坚怎么想也想不明白，怎么好好的传一句话就传败了呢？淝水之战（公元383年），跟三国赤壁之战（公元208年）很像，都是经历了近百年分裂之后，北方政权尝试再次统一中国，而且两次都在绝对优势的情况下被以少胜多，未能成功统一中国。赤壁之战失败了，实现统一的愿望又等了近百年，好不容易等来西晋灭东吴（公元280年），却只有短短10年的西晋统一。而淝水之战失败了，实现统一的愿望又等200年，才等来隋朝灭南陈（公元589年）。如果不算短命西晋，从公元189年董卓进京开始乱政，地方诸侯各自起兵逐鹿中原，中国开始进入分裂，一直到公元589年隋朝灭南陈，中国整整经历了400年的分裂。 苻坚一败，那一块块马赛克就都又活跃起来了，其中就有第四胡——羌。羌族其实也是西戎的一支，主要分布在西北，陕西甘肃四川都有。在先秦史籍中往往氐羌连用或并称，而羌比氐出名，毕竟现在还有羌族，但已经没有氐族了。先秦人甚至认为氐人是生活在氐地的羌人，但又觉得氐和羌略有区别，因此称氐为氐羌。羌族对汉朝而言也是一个外患，收拾完匈奴后，主要就是对付西北羌族了。其中最有成绩的应该算是伏波将军马援了，也就是三国马超的祖先，让羌族人很信服，马家在西北是很有声望的。 到了西晋末年，北方大乱，世代为羌族酋长的姚家也带着羌族兄弟们起来追求独立自主，不过也没怎么成大气候。后来姚襄在与前秦交战时被俘杀，他弟弟姚苌（cháng）率部降于前秦。苻坚继位后，姚苌多次立功，很受苻坚喜欢。喜欢到什么程度呢？话说快打淝水之战的时候，苻坚把姚苌叫过来，说：“你之前干的不错，这次打东晋你要好好努力哦！你知道我当皇帝之前是什么官职吗？是龙骧将军！皇帝这个位置是不能给你的，但是，我可以封你为龙骧将军！这个官职我可是从来没有让别人当过哦！我很看好你吧！好好干哦！”好吧，你让他好好干，沿着你的脚印走好吧？现在你让他跟你一样当龙骧将军，下一步你想让他跟你一样当什么？也不知道是庆幸还是不幸，反正姚苌不负苻坚所望，淝水之战后想清楚了，就真反了自己当皇帝。公元384年，姚苌在渭北马牧，被羌民和西州豪族推为盟主，称大将军、大单于、万年秦王，史称后秦。公元385年，姚苌围擒出逃的苻坚，后将苻坚缢杀。公元386年四月，正式称帝，建都长安。 图10 后秦疆域图（中间淡紫色区域） 从疆域图中也可以看出来，后秦崛起得也不咋的，最后还让东晋给灭了。说实话东晋没灭过几个国家。不过后秦也是遇上猛人了，因为这位东晋的猛人不止灭了后秦，还灭了东晋，这就是南朝宋国开国皇帝刘裕。 而跟着姚苌一起活跃起来的，还有最后一胡——鲜卑。鲜卑这个词现在对很多人而言已经很陌生了，但其实很多人经常听到和鲜卑同义的一个词，只是我们不知道说的就是鲜卑。每到冬天，天气预报经常讲，又有一股冷空气，从鲜卑利亚，吹向我们北方地区。这个鲜卑利亚是哪里？对，就是西伯利亚（Siberia）。鲜卑利亚，就是鲜卑人的土地的意思，是鲜卑人的发源地。 当年匈奴崛起的时候，匈奴东面还有一群胡人，被称为东胡。匈奴冒顿单于开挂，把东胡打得差不多了，除了死的降的，剩下的就跑到两座山上去躲了起来。这两座山一座在大兴安岭南端，叫乌桓（又叫乌丸）；一座在大兴安岭北端，叫鲜卑。乌桓比较靠南，在汉朝打败匈奴之后还出来蹦跶了一下，让曹操给灭了。而鲜卑则在匈奴西迁之后，主要在北方抢地盘，靠南的几个部族也随着其他几胡一起来乱中华。 鲜卑族分为几个部族，有段氏，宇文氏，拓跋氏，慕容氏。慕容鲜卑，在乱华的时候就建立了各种燕国。先是慕容皝（huàng）在龙城（今辽宁朝阳）建立前燕，后来慕容家又建立了后燕、西燕、南燕（北燕是鲜卑化的汉人冯跋扶持后燕慜帝慕容宝的养子慕容云（高句丽人高云）建立的，后冯跋自己称帝）。《天龙八部》里面的姑苏慕容复一心想复国的燕国，就是这个燕。 鲜卑族，史书上的描述是：赤髯碧眼老鲜卑。《晋书》将鲜卑人称为黄头黄须。在西晋时期有“白奴”之称，苻坚也怒称他们为“白虏”，可见他们是白种人，金发碧眼白皮肤的高加索人种。所谓一白遮百丑，长得白净自然惹人喜欢，要是再五官端正，身材高窕，那真是没说了。前燕皇子慕容冲姐弟俩就长得非常秀美，于是苻坚灭了前燕后，将这姐弟俩都收入后宫，••••••（此处删去儿童不宜的*字）。因此苻坚淝水之战失败后，慕容家又复辟。慕容垂在荥阳（今河南荥阳）复称燕王，建立后燕。慕容泓在关中向长安进军，改年号为燕兴，建立西燕。那个美男慕容冲接了慕容泓的班，把长安死死围住，逼跑了苻坚（苻坚跑出去后就被姚苌抓了），灭了前秦。 这是慕容鲜卑，另一个厉害的鲜卑，则是拓跋鲜卑。这是五胡终结者，要介绍拓跋鲜卑，得另起一章了。 另外，这里介绍一个词——可汗（Khagan），也翻译为汗（Khan），为了表示强大也叫大汗，为跟汉文化融合也叫汗王。这个称呼最早被用于称呼鲜卑部落的酋长，不同于匈奴的单于。五胡乱华时，各个强者强大到一定程度都会担任“大单于”的官职，包括鲜卑的慕容皝。毕竟鲜卑也跟匈奴混过嘛，学学人家很正常，就像他们最后登顶的时候都是担任“皇帝”一样，跟汉人学的。但是有一支慕容鲜卑，带头的叫慕容吐谷浑（tǔ yù hún），因为在老家（现辽宁省东部）混不下去，就带着自己的小弟们，在公元283年西迁到今内蒙古自治区阴山地区。公元313年左右，又从阴山南下，至陇西枹罕（今甘肃省临夏），以此为根据地，向南、北、西三面拓展，统治今青海省、甘肃省南部、四川省西北等地，这就是后来的吐谷浑汗国（从图7到图10，地图西侧一直有个吐谷浑汗国）。因为没在中原跟大家一起玩，没学到，也不好意思用一些高大上的词汇，所以他们的领袖一直以可汗自称。而在中原，随着鲜卑族的崛起，自我认同感和民族自豪感的提升，后来就渐渐以“可汗”为傲，以“可汗”自称，而不再使用匈奴的“单于”称呼了。","categories":[{"name":"民族","slug":"民族","permalink":"https://mineduan.github.io/wuwenxidong/categories/民族/"}],"tags":[{"name":"少数民族去哪了","slug":"少数民族去哪了","permalink":"https://mineduan.github.io/wuwenxidong/tags/少数民族去哪了/"}]},{"title":"少数民族去哪了（一）：匈奴","slug":"少数民族去哪了（一）：匈奴","date":"2018-01-21T16:00:00.000Z","updated":"2018-01-22T14:15:22.378Z","comments":true,"path":"2018/01/22/少数民族去哪了（一）：匈奴/","link":"","permalink":"https://mineduan.github.io/wuwenxidong/2018/01/22/少数民族去哪了（一）：匈奴/","excerpt":"早在西周时期，就有西戎对镐京的骚扰压力，于是周天子设了烽火台用于搬救兵。但是一个烽火戏诸侯导致的西戎烧镐京，逼得周天子东迁洛阳，结束了西周三百年的历史。随后又把八百里秦川封给了秦国，作为奖励秦国平灭西戎的功绩，给了秦国第一桶金。 历史就这样进入了春秋战国。","text":"早在西周时期，就有西戎对镐京的骚扰压力，于是周天子设了烽火台用于搬救兵。但是一个烽火戏诸侯导致的西戎烧镐京，逼得周天子东迁洛阳，结束了西周三百年的历史。随后又把八百里秦川封给了秦国，作为奖励秦国平灭西戎的功绩，给了秦国第一桶金。 历史就这样进入了春秋战国。 春秋战国时期，北方崛起了第一个强大的游牧民族，就是大家熟悉的匈奴。这段时期匈奴跟中原一样，都在进行着大融合。中原从春秋的八百诸侯慢慢融合成战国七雄，最后一统为大秦帝国。同样在北方，匈奴也逐渐将各个部族统一到同一面旗帜下。当然啦，北方游牧民族的组织结构比起中原王朝的农耕文明，那显然是松散很多了，但是同时也让他们灵活很多。匈奴在融合的过程中也没闲着，到了秋冬时节还是不忘南下抢一把。于是北方几个诸侯学着西周的方法，也修了烽火台。但是国境太长，也不知道匈奴从哪里攻来，那就修一条线吧。于是有了秦长城，赵长城和燕长城。到了秦统一天下，就干脆派蒙恬把这几段长城联起来，成了世上最伟大的一面墙——万里长城the Great Wall。 战国末期，头曼崛起为第一代匈奴单于，其子冒顿（mò dú）通过鸣镝弑父成为了第二代单于。 这个故事很出名。头曼单于想立小儿子，于是把大儿子冒顿送给月氏国当人质，同时又进攻月氏国，就是想让月氏国杀掉冒顿。不料这小子好机灵，竟然跑回来了。老子也想：“这小伙还不错，好好培养说不定还真能接我班。”于是放弃伤害冒顿的念头，还给了一万骑兵让他统领。头曼是自我感觉跟儿子冒顿冰释前嫌了，冒顿可不这么想，他就打算用这一万骑兵把他老子扳倒。于是他做了一支鸣镝，就是射出去会发出声响的箭。他命令他的骑兵部队，他的鸣镝射向哪里，骑兵们就必须往哪里射箭（游牧民族的骑兵主要是弓骑兵，一边骑马一边射箭攻击）。于是第一次，外出打猎时，冒顿将鸣镝射向一只野猪，有部分骑兵傻傻没反应过来，没有及时跟着冒顿一起开弓，都被冒顿杀掉了。第二次，冒顿将剩下的骑兵召集过来，对着自己最喜欢的坐骑射出了鸣镝。有些骑兵傻了，那可是老大最喜欢的坐骑，对于一个匈奴人而言，无论是进攻还是撤退，一匹好马那可意味着生命中各个环节都快一步啊。别说匈奴人，就连人人熟悉的武圣关二爷，有个挂印封金的故事，他离开曹操去找刘备的时候，曹操赏赐的官印黄金说不要就不要，统统不要，但还是舍不得好马赤兔，走的时候还是把赤兔骑走了。对于一个要上沙场征战的人，一匹好马就是第二生命啊。可是冒顿就这样把鸣镝射向了自己最心爱的坐骑。而那些傻了的骑兵，也被冒顿筛选掉了。第三次，这更狠，冒顿选择的对象是自己最宠爱的妻子，经过前两次的教训，大家都学明白了，毕竟没学明白的前两次都已经被剔除了。这个可怜的女人就这样成了试验品。这三次，骑兵们只需要考虑老大冒顿是怎么想的。于是冒顿开始试探第四次，这次选的是他老爸头曼单于的坐骑。这下子骑兵们都要想了，是考虑最高领导的感受重要，还是直接领导的感受重要。当然啦，骑兵替最高领导感受考虑的这份操心，最高领导也没感受到，因为这部分人，又被干掉了。最后剩下的这些人，是可以跟着他冒顿去弑父的部下。于是冒顿最后一次射出鸣镝，指向了他的父亲。跟在鸣镝后面的，是把头曼扎成刺猬的箭矢。这个故事也出现在电视剧《汉武大帝》里了，不过主角被换成了冒顿的孙子伊稚斜单于。 冒顿是一个伟大的领袖，在他的带领下，匈奴扩张到了顶峰，东灭东胡，西逐月氏，南困汉高祖，就是白登山事件。汉高祖刘邦统一中原后，觉得匈奴是个麻烦事，想一次性解决，于是御驾亲征，不料兵败被困。 图3 汉代匈奴图（来自百度图片） 从此汉朝对匈奴的政策就从武力解决转为和亲，就是用钱和女人换来和平和时间，在和平的环境里发展自己，发展到汉武帝刘彻的时候，就准备算旧账了。话说汉武帝时期国库有钱到什么程度，就是那个钱多得一直堆在那里用不上，甚至穿铜钱用的麻绳都烂掉了也没机会用上。这么多钱，不花干嘛？干什么最花钱？打仗嘛！于是汉武帝布武天下，东吞朝鲜，南平闵越，西通塞外，最主要的还是北击匈奴。汉武帝重用两个外戚——卫青和霍去病，这舅甥俩收复河套，横扫王庭，封狼居胥，登临瀚海（就是现在的贝加尔湖），“是后匈奴远遁，而漠南无王庭”（《汉书》）。 图4 电视剧《汉武大帝》中的卫青与霍去病 遭受沉重打击的匈奴也开始思考下一步该怎么办，于是分裂为两大派。一派觉得，汉朝实力强大，赢得了一时赢不了一世，耗不起，还是降了算了，这属于投降派。另一派觉得，我们匈奴是狼的子孙，哪能轻易低头，继续跟汉朝死磕，这是主战派。投降派于公元前53年，在呼韩邪单于的率领下向汉元帝投降，后来还娶了四大美女之一的王昭君，这就是昭君出塞。这一部匈奴就是南匈奴，汉元帝又把他们放在河套地区，作为防范北匈奴屏障。北匈奴，就是另一派主战派，他们延续着祖先的习俗，春夏放牧，秋冬打劫，时不时还是在骚扰汉朝的边境。于是汉朝决定再给匈奴来个致命一击。这次出场的是东汉的两个外戚——窦固和窦宪，这爷孙俩（从辈分上讲，窦固是窦宪的爷爷辈）从汉明帝时期的公元72年开始，一直打到汉和帝时期的公元91年，把之前的北匈奴愣是又打成一南一北。南匈奴继续内附投降，北匈奴继续不投降。 图5 窦固与窦宪 那北匈奴不投降，就被东汉接着打，一直打到公元151年，北匈奴呆不下去了，只能远遁，下落不明。于是汉朝这边记载：公元151年，北匈奴被打跑，消失于西方。那哪里去了呢？因为匈奴没有自己的文字，没有自己的记录。那西方谁有记录？同时期的罗马帝国，他们留下了可考的记载，他们写到：公元290年左右，东方突然来了一群人，黑头发黑眼睛黄皮肤，他们就是Hun（翻译为匈人）。这中间隔了一个半世纪的空档。如果你是匈奴人，你会很骄傲地写下：“我是匈奴！”吗？大家都知道奴这个字不是什么高大上的字，谁会用这种字给自己起名字呢？因为这个名字不是匈奴自己起的，是我们汉人给起的。匈奴文化程度低，前面说过，没有自己的文字。更重要的，是匈奴最后为我所败。像什么匈奴，什么倭国，这些打不过我们的，我们给他们起的名字就不那么高大上。再看看“英吉利”啊，“法兰西”啊，“美利坚”啊，多么美丽的文字。人家日本翻译就不叫“美国”而叫“米国”。你看满清努尔哈赤的“努”就不用“奴隶”的“奴”。你敢！文字狱早把你干掉了。准备革满清命的章太炎就直接翻译为“奴儿哈赤”。（《驳康有为论革命书》） 所以“匈奴”只是一个音译，一个大概的发音。而另一个音译，就是“胡”。赵武灵王的“胡服骑射”，就是学匈奴的服装和作战方式。冒顿单于给汉帝书中说：“南有大汉，北有强胡”（《汉书•匈奴传》），就是说自己是胡。随着匈奴人的扩张，很多北方的少数民族都加入了匈奴这个大家庭，于是“胡”成了北方少数民族的通称，包括东北的，西北的。就像“秦”本来只是周天子的一个诸侯，而跟着李牧跟匈奴打仗的是“赵人”，可是秦统一天下后，原先跟着李牧打仗的“赵人”就都变成“秦人”了。 现在很多带“胡”的物品，就是指后来从胡人那里传过来的，跟已经有的物品很像。例如胡萝卜，中原本土出产的是白萝卜。例如胡椒，中原本土出产的是花椒，而辣椒是产自墨西哥，要等哥伦布发现新大陆后才能传入，两湖四川的朋友们表示等得很着急。例如胡瓜，东晋十六国时北石勒改为黄瓜，本土的瓜还真不好考证是什么瓜，是葫芦瓜吗？不过葫芦的“葫”，还真不是“胡”，葫芦的“葫”是来自“瓠”（hù），这是个本土产品，而后来的叫西葫芦。带“西”的也是外来品种，西边来的，例如西瓜，还有西红柿。本土的叫柿子。而西红柿还有一个名字叫番茄。带“番”的也是外来品种。对应本土的是北方常见的圆茄子（茄子也是外来的，只是来的时候没别的跟它很像。）。还有番薯，本土的薯片是山药。越洋而来的外国人被称为 “洋夷”，“洋人”，随他们而来的外来品种，就带了个“洋”字。例如洋葱，洋芋（对应本土的芋头，陕北地区对土豆的叫法）。 为什么“番”也是指外族异地来的呢？这可以从夏商周的管理制度说起。《汉书》记载，大禹治水后，对天下进行划分，“制九州，列五服”。九州大家都比较熟悉，五服是什么？《国语•周语》记载：“夫先王之制，邦内甸服，邦外侯服，侯卫宾服，蛮夷要服，戎狄荒服。”就是按照距离王畿的远近，划分了五个档次。《尚书•禹贡》记载：五百里甸服。五百里侯服。五百里绥服。五百里要服。五百里荒服。距离最远的要服和荒服都是蛮夷戎狄，因此有东夷西戎南蛮北狄的说法，都是些不服王化的野蛮人。这是夏朝的划分，而到了周朝，周公著的《周礼•夏官•职方氏》记载已经发展到“九服”：“乃辨九服之邦国：方千里曰王畿，其外方五百里曰侯服，又其外方五百里曰甸服，又其外方五百里曰男服，又其外方五百里曰采服，又其外方五百里曰卫服，又其外方五百里曰蛮服，又其外方五百里曰夷服，又其外方五百里曰镇服，又其外方五百里曰藩服。”（按一里为500米的长度算，西周首都镐京在现西安，西安到上海三千里，到广州三千多里，到北京两千多里，到乌鲁木齐五千里）可见藩比蛮夷还要蛮夷。藩，通“蕃”，通“番”。最外围的藩服，是那时候已知的极限，后来就变成了最外围的边界，变成屏障，因此各家院子外都有“藩篱”，蒙恬为秦修长城是建“藩屏”，刘邦分封的诸王是拱卫京师的“藩国”（汉景帝和晁错想削弱诸王就叫“削藩”），大唐四周的守卫军区叫“藩镇”。 无论是“匈奴”还是“胡”，发音都和Hun有些接近。那么出现在西方Hun是不是从东方过去的匈奴人呢？法国著名东方学家、法兰西学院教授J. de Guignes（约瑟夫.德.吉涅）在其巨著《匈人、突厥、蒙古人及其它西方鞑靼的通史》（1756-1758）中，第一次推断西方的Hun就是东方匈奴的后裔。随后英国著名历史学家E. Gibbon（爱德华.吉本1737-1794）将Guignes的观点写入了个人巨著《罗马帝国衰亡史》中。法国学者R. Grousset（勒内.格鲁塞）在《草原帝国》（1939）中也称Hun是匈奴的一支。不过二战之后，“匈人就是匈奴人”的说法受到了世界各地学者的强烈质疑。因为两者差异还是蛮多的，例如骨骼，宗教，文化，工具等。有兴趣了解的读者可以自己去查看。但是毕竟中间隔了一个半世纪的空档。这一群人一路西行，可别指望他们安静地路过，所到之处必然也是血与火。男杀女抢幼为奴。通过这种方式，也一路与原住民进行这混血融合。在不到20岁早当爹的年代，公元290年的年轻人，都是公元150年年轻人的第八代孙子了。140年的时间能改变多少？工业革命总共也不到100年的时间，就带给我们翻天覆地的变化。因此有差异也很正常。反正认为是的无法给出确凿证据，认为不是的也无法充分证明自己的正确。所以我们就认为他是吧。 于是这帮彪悍的匈奴人，就登上了西方的历史舞台。这是一个骑马打仗的民族，虽然打不过强大的汉朝，打打西边的其他民族还是绰绰有余的。先是中欧的阿兰国，然后是北欧的日耳曼人，然后是东罗马帝国，西罗马帝国。在横扫欧洲的过程中，匈奴人所过之处血流成河，国破家亡，让欧洲人闻风丧胆。这场灾难，被称为第一次“黄祸”（第二次就是蒙古了）。而其中最有名的，就是匈奴王阿提拉。不过欧洲人是怎么看待这个事件的？他们可不会用历史唯物史观来理解。信仰基督教的他们觉得，是由于自己腐败堕落，充满罪恶，于是上帝惩罚他们，让阿提拉来鞭挞他们的肉体和灵魂，因此阿提拉被称为“上帝之鞭”。在阿提拉死去之后，匈奴帝国分崩离析，不复昨日强大，加上中欧那个地方各色人等你来我往，多人种在这里融合发展。虽然匈奴人的基因肯定在某些人身上流传了下来，但是今日的中欧已经很难找到所谓匈奴人的后裔了。只留下一个名字，让人们记得曾经还有这么一群Hun在这里留下过痕迹，那就是Hungary（匈牙利）。 也正是由于匈奴的进攻，导致大量的日耳曼人迁徙进入了西罗马帝国，最后导致西罗马的灭亡，这就是有名的日耳曼入侵，又叫日耳曼大迁徙。整理一下，汉朝把匈奴打了，于是匈奴往西把日耳曼人打了，于是日耳曼人往西把罗马人打了，西罗马没地方去了，就亡了。因此对西罗马的灭亡，我们大汉朝是负有不可推卸的责任的！我们表示深深的歉意！ 图6 匈奴西迁","categories":[{"name":"民族","slug":"民族","permalink":"https://mineduan.github.io/wuwenxidong/categories/民族/"}],"tags":[{"name":"少数民族去哪了","slug":"少数民族去哪了","permalink":"https://mineduan.github.io/wuwenxidong/tags/少数民族去哪了/"}]},{"title":"我来，想告诉你，这是我喜欢的方式","slug":"我来，想告诉你，这是我喜欢你的方式","date":"2018-01-17T04:20:57.000Z","updated":"2018-01-18T12:43:54.977Z","comments":true,"path":"2018/01/17/我来，想告诉你，这是我喜欢你的方式/","link":"","permalink":"https://mineduan.github.io/wuwenxidong/2018/01/17/我来，想告诉你，这是我喜欢你的方式/","excerpt":"","text":"##每当我想起你，嘴角就会不自觉的上扬，即使外界多么喧闹，也不能打扰 ##没有去看你以前的日志，因为你说你忘记了过去，我就相信 ##总记得我开始喜欢你时，你的衣着打扮，你的笑容，你的语气 ##我说先看一下星座配不配，你说不合也要合，我看了结果觉得很有勇气继续 ##你说心情不好的时候，总是说不出来理由，我也不知道如何化解，只会耍宝，逗你开心，并且心情跟着不好 ##因为你收集了很多DVD我没有看过，我在悄悄的看，每次你看的时候都认真的陪着你看，即使我并不懂 ##一看到路边的情侣用品就想买来送给你，比如戒指，巧克力，情侣装","categories":[],"tags":[{"name":"test","slug":"test","permalink":"https://mineduan.github.io/wuwenxidong/tags/test/"}]},{"title":"你不相信这个世界，但它依然很美","slug":"你不相信这个世界，但它依然很美","date":"2018-01-17T02:27:58.000Z","updated":"2018-01-18T12:43:42.825Z","comments":true,"path":"2018/01/17/你不相信这个世界，但它依然很美/","link":"","permalink":"https://mineduan.github.io/wuwenxidong/2018/01/17/你不相信这个世界，但它依然很美/","excerpt":"","text":"","categories":[],"tags":[{"name":"test","slug":"test","permalink":"https://mineduan.github.io/wuwenxidong/tags/test/"}]}]}